[net]
# Testing
batch=1
subdivisions=1
# Training
#batch=64
#subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00261
burn_in=1000
max_batches = 2000200
policy=steps
steps=1600000,1800000
scales=.1,.1

# p1 ReOrg DownC
[convolutional]
batch_normalize=1
filters=12
size=3
stride=2
groups=3
pad=1
activation=linear

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=silu


# p2 DownC
[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=96
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3 
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=silu 
[route]
layers=-1, -4


# CSP-VOVNet
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2 
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
 
[route]
layers = -11,-9,-7,-5,-3,-1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=0
activation=silu



# p3 DownC
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[route]
layers=-3
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-1,-4



# CSP-VoV   stage-2  
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2 
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[route]
layers = -11, -9, -7, -5,-3, -1
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=0
activation=silu


# p4 DownC
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3 
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu 
[route]
layers=-1,-4

# CSP-VoV
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2 
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[route]
layers = -11, -9, -7, -5, -3, -1 
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=1
activation=silu



# p5 DownC
[convolutional]
batch_normalize=1
filters=576
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=576
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3 
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=576
size=3
stride=1
pad=1
activation=silu 
[route]
layers=-1,-4

# CSP-VOVNet 
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2 
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=0
activation=silu 
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
 
[route]
layers = -11, -9, -7, -5, -3, -1
[convolutional]
batch_normalize=1
filters=1152
size=1
stride=1
pad=0
activation=silu


# p6 DownC
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=768
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3 
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=768
size=3
stride=1
pad=1
activation=silu 
[route]
layers=-1,-4

# CSP-VOVNet 
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

[route]
layers=-2 
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu 
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=silu
 
[route]
layers = -11, -9, -7, -5, -3, -1
[convolutional]
batch_normalize=1
filters=1536
size=1
stride=1
pad=0
activation=silu


################### BackBone-end  &  Neck-start ############### 

### SPPCSP ###
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=silu

[route]
layers = -2 
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=768
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=silu
 
### SPP ###
[maxpool]
stride=1
size=5 
[maxpool]
stride=1
size=5 
[maxpool]
stride=1
size=5 
[route]
layers=-1,-2,-3,-4
### End SPP ### 
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=silu

[route]
layers = -10, -1
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=silu
 
### End SPPCSPC ###


# route backbone P5
[convolutional]
batch_normalize=1
filters=576
size=1
stride=1
pad=0
activation=silu 
[upsample]
stride=2 
[route]
layers = 77
[convolutional]
batch_normalize=1
filters=576
size=1
stride=1
pad=1
activation=silu 
[route]
layers = -1,-3

#  CSP - Mix - Convs 
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu 
[route]
layers = -2
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 

[route]
layers = -11,-9, -7, -5, -3, -1 
[convolutional]
batch_normalize=1
filters=576
size=1
stride=1
pad=1
activation=silu


# route backbone P4
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu 
[upsample]
stride=2 
[route]
layers = 58
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu 
[route]
layers = -1,-3


#  CSP - Mix - Convs  
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2 
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[route]
layers = -11,-7,-5,-3,-1 
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu

# route backbone P3
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=silu 
[upsample]
stride=2 
[route]
layers = 39
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=silu 
[route]
layers = -1,-3


#  CSP - Mix - Convs  
#  [-1, 1, Conv, [128, 1, 1]],
#  [-2, 1, Conv, [128, 1, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [-1, 1, Conv, [64, 3, 1]],
#  [[-1, -2, -3, -4, -5, -6, -7, -8, -9, -10], 1, Concat, [1]],
#  [-1, 1, Conv, [192, 1, 1]], # 115
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[route]
layers = -10,-7,-5,-3,-1 
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=silu

################### Neck-end  &  head-start ############### 

[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=255
size=1
stride=1
pad=1
activation=silu
[yolo]
mask = 0,1,2
anchors =19,27, 44,40, 38,94, 96,68, 86,152, 180,137, 140,301, 303,264, 238,542, 436,615, 739,380, 925,792
classes=80
num=12

#########################################
#   [-1, 1, DownC, [384]],
#   [[-1, 99], 1, Concat, [1]],
[route]
layers=-4 

[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -4, 144
# 144   126  108

#######  CSP- mix-conv   #######
#  [-1, 1, Conv, [256, 1, 1]],
#  [-2, 1, Conv, [256, 1, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [-1, 1, Conv, [128, 3, 1]],
#  [[-1, -2, -3, -4, -5, -6, -7, -8, -9, -10], 1, Concat, [1]],
#  [-1, 1, Conv, [384, 1, 1]], # 129
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu 

[route]
layers = -2
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu   
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu  

[route]
layers =-10,-9,-7,-5,-3,-1 
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu  



[convolutional]
batch_normalize=1
filters=768
size=3
stride=1
pad=1
activation=silu  
[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear 
[yolo]
mask = 3,4,5
anchors = 19,27, 44,40, 38,94, 96,68, 86,152, 180,137, 140,301, 303,264, 238,542, 436,615, 739,380, 925,792
classes=80
num=12 

######################################### 
#  [-1, 1, DownC, [576]],
#  [[-1, 83], 1, Concat, [1]],
[route]
layers=-4 

[convolutional]
batch_normalize=1
filters=288
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=288
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3 
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=288
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -4, 126 
 
##############################   CSP - mix - Convs 
#  [-1, 1, Conv, [384, 1, 1]],
#  [-2, 1, Conv, [384, 1, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [-1, 1, Conv, [192, 3, 1]],
#  [[-1, -2, -3, -4, -5, -6, -7, -8, -9, -10], 1, Concat, [1]],
#  [-1, 1, Conv, [576, 1, 1]], # 143
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu 

[route]
layers = -2
[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=1
activation=silu   
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=silu  

[route]
layers =-10,-9,-7,-5,-3,-1 
[convolutional]
batch_normalize=1
filters=576
size=1
stride=1
pad=1
activation=silu  



[convolutional]
batch_normalize=1
filters=1152
size=3
stride=1
pad=1
activation=silu  
[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear 
[yolo]
mask = 6,7,8
anchors =19,27, 44,40, 38,94, 96,68, 86,152, 180,137, 140,301, 303,264, 238,542, 436,615, 739,380, 925,792
classes=80
num=12 


######################################### 
#  [-1, 1, DownC, [768]],
#  [[-1, 67], 1, Concat, [1]],
[route]
layers=-4 

[convolutional]
batch_normalize=1
filters=384
size=1
stride=1
pad=0
activation=silu
[convolutional]
batch_normalize=1
filters=384
size=3
stride=2
pad=1
activation=silu 
[route]
layers=-3 
[maxpool]
size=2
stride=2
[convolutional]
batch_normalize=1
filters=384
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -4, 108

#  [-1, 1, Conv, [512, 1, 1]],
#  [-2, 1, Conv, [512, 1, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [-1, 1, Conv, [256, 3, 1]],
#  [[-1, -2, -3, -4, -5, -6, -7, -8, -9, -10], 1, Concat, [1]],
#  [-1, 1, Conv, [768, 1, 1]], # 157

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=silu 

[route]
layers = -2
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=silu   
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu 
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu  

[route]
layers =-10,-9,-7,-5,-3,-1 
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=1
activation=silu   

[convolutional]
batch_normalize=1
filters=1536
size=3
stride=1
pad=1
activation=silu  
[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear 
[yolo]
mask = 9,10,11
anchors = 19,27, 44,40, 38,94, 96,68, 86,152, 180,137, 140,301, 303,264, 238,542, 436,615, 739,380, 925,792
classes=80
num=12

